template_tmp.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <s:Header>
    <o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" s:actor="http://smev.gosuslugi.ru/actors/smev">
      <o:BinarySecurityToken u:Id="uuid-ee82d445-758b-42cb-996c-666b74b60022-2" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
      </o:BinarySecurityToken>
      <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
        <SignedInfo>
          <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
          <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411" />
          <Reference URI="#_1">
            <Transforms>
              <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
            </Transforms>
            <DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411" />
            <DigestValue>
            </DigestValue>
          </Reference>
        </SignedInfo>
        <SignatureValue>
        </SignatureValue>
        <KeyInfo>
          <o:SecurityTokenReference>
            <o:Reference ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" URI="#uuid-ee82d445-758b-42cb-996c-666b74b60022-2" />
          </o:SecurityTokenReference>
        </KeyInfo>
      </Signature>
    </o:Security>
  </s:Header>
  <s:Body u:Id="_1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <GasuMessage xmlns="http://smev.gosuslugi.ru/rev120315">
      <Message>
        <Sender>
          <Code>DISKK01</Code>
          <Name>Автоматизированная информационная система "Мониторинг социально-экономического развития Краснодарского края"</Name>
        </Sender>
        <Recipient>
          <Code>DISKK01</Code>
          <Name>Автоматизированная информационная система "Мониторинг социально-экономического развития Краснодарского края"</Name>
        </Recipient>
        <Originator>
          <Code>DISKK01</Code>
          <Name>Автоматизированная информационная система "Мониторинг социально-экономического развития Краснодарского края"</Name>
        </Originator>
        <ServiceName />
        <TypeCode>GFNC</TypeCode>
        <Status>REQUEST</Status>
        <Date>2014-07-29T11:43:31.96921+03:00</Date>
        <ExchangeType>XXXX11111</ExchangeType>
        <RequestIdRef>XXXX11111</RequestIdRef>
        <OriginRequestIdRef>XXXX11111</OriginRequestIdRef>
        <ServiceCode>XXXX11111</ServiceCode>
        <CaseNumber>XXXX11111</CaseNumber>
        <TestMsg />
      </Message>
      <MessageData>
        <AppData>
          <AppMessage>
            <AppHeader>
              <ID>12345</ID>
              <DataSourceRef>8765</DataSourceRef>
              <HeaderInfo />
            </AppHeader>
            <MessageType>ImportFull</MessageType>
            <Body />
          </AppMessage>
        </AppData>
      </MessageData>
    </GasuMessage>
  </s:Body>
</s:Envelope>